Repository: kenanqanas500/elegantech_test
Catalog: lib/l10n/app_*.arb
Languages: ar

# welcomeText
source: Welcome to the App
ar: أهلاً بك في تطبيق

source: Login
ar: تسجيل الدخول

# loginButton
source: Login
ar: تسجيل الدخول

# pleaseEnterPhoneAndPass
source: Please enter your phone number and password
ar: الرجاء إدخال رقم الجوال وكلمة المرور

source: Change Server IP
ar: تغيير سيرفر الخادم

# setupConnection
source: Setting up server connection
ar: تجهيز الاتصال بالسيرفر

# enterServerNumber
source: Enter your restaurant's server number
ar: أدخل رقم الخادم الخاص بمطعمك

source: Server number
ar: رقم الخادم

# continueText
source: Continue
ar: متابعة

source: Cancel
ar: إلغاء

# dataSyncedDone
source: Data synced successfully
ar: تمت مزامنة البيانات بنجاح

source: Confirm
ar: تأكيد

# tables
source: Halls
ar: الصالات

source: Receipts
ar: الفواتير

source: Groups
ar: المجموعات

# hallsAndTabels
source: Halls and Tables
ar: الصالات والطاولات

source: The Receipt
ar: الفاتورة

source: Groups and Food
ar: المجموعات والأكلات

# request
source: Request Bill
ar: طلب حساب

source: Print
ar: طباعة

# enterTableId
source: Please select a table first to view the meals
ar: الرجاء اختيار طاولة أولا لعرض المأكولات

# enterHallId
source: Select Hall
ar: اختر صالة

# enteerHallIdToShowTables
source: Please select a specific hall to view its tables
ar: الرجاء اختيار صالة محددة لعرض الطاولات التابعة لها

# changedSuccessfully
source: Server IP changed successfully
ar: تم تغيير عنوان السيرفر بنجاح

# addServerIp
source: Please enter the server IP first
ar: الرجاء إدخال سيرفر الخادم أولا

# noHalls
source: No halls to display currently
ar: لايوجد صالات لعرضها الآن

# noTables
source: No tables in the selected hall
ar: لايوجد أي طاولات في الصالة المختارة

# noCategories
source: No food categories available
ar: لايوجد أية تصنيفات طعام

# noFood
source: No food items for the selected category
ar: لايوجد أية مأكولات للصنف المختار

# noNotes
source: No additions available
ar: لاتوجد أية اضافات

source: Reserved
ar: تم حجزها

# receiptNumber
source: Receipt No.
ar: فاتورة رقم

# orderIsPending
source: Sent to Kitchen
ar: وصلت للمطبخ

# orderIsRequested
source: Bill requested, remaining
ar: تم طلب الحساب، المتبقي

# orderIsPreparing
source: Order is being prepared
ar: الطلب قيد التحضير

# orderIsDone
source: Order is ready
ar: الطلب جاهز

# orderIsPaid
source: Bill fully paid
ar: تم دفع الفاتورة كاملا

source: Table
ar: طاولة

source: Captain
ar: كابتن

source: Delete Invoice
ar: حذف الفاتورة

# receiptTableName
source: / Table No.
ar: / طاولة رقم

# theMaterialOrder
source: Item
ar: المادة

# thePrice
source: Price
ar: السعر

# theAmount
source: Amount
ar: الكمية

# theProcess
source: Action
ar: العملية

source: Total Price
ar: السعر الإجمالي

# theNumber
source: Quantity
ar: العدد

# peicePrice
source: Unit Price
ar: سعر الفرد

source: Receipt
ar: فاتورة

source: Choose Hall
ar: اختر صالة

# theHall
source: Hall
ar: الصالة

# noReceipts
source: No receipts currently available for you
ar: لاتوجد أي فاتورة لك حاليا

# itemAddedSuccessully
source: Item successfully added to receipt
ar: تم إضافة العنصر للفاتورة

# itemDeletedSuccessfully
source: Item successfully deleted from receipt
ar: تم حذف العنصر من الفاتورة

# tableIsReservedSsuccessfully
source: Table reserved successfully
ar: تم حجز الطاولة بنجاح

# totalPriceAfterDiscount
source: Total after discount:
ar: المجموع بعد الخصم:

# pleaseMakeSureIpIsCorrect
source: Please make sure the IP is correct, or the server might be offline. Try again later.
ar: الرجاء التحقق من العنوان، أو السيرفر قد يكون مغلقا حاليا، الرجاء المحاولة لاحقا

# connectionE
source: Connection timeout. Please check your internet connection and try again.
ar: انتهت مهلة الاتصال، الرجاء الاتصال بالإنترنت والمحاولة مجددا

# internetE
source: Check your internet connection and try again.
ar: تأكد من الاتصال بالإنترنت وحاول مجددا

# serverE
source: A server error occurred. Please try again later.
ar: حدث خطأ من السيرفر، الرجاء المحاولة لاحقا

# receiptPrintedE
source: Failed to print the receipt
ar: فشلت طباعة الفاتورة

# recieptPrinted
source: Invoice printed successfully
ar: تمت طباعة الفاتورة بنجاح

# deviceIsTablet
source: This app is not designed for tablets
ar: هذا التطبيق غير مخصص لتطبيقات التابلت

# userNameV
source: Please enter your username
ar: الرجاء إدخال اسم المستخدم

# passwordV
source: Please enter your password
ar: الرجاء إدخال كلمة المرور

# phoneNumberV
source: Please enter your phone number
ar: الرجاء إدخال رقم الهاتف

# serverIpV
source: Please enter the server IP
ar: الرجاء إدخال عنوان الخادم

# serverIpV2
source: Please enter a valid IP address
ar: الرجاء إدخال عنوان صحيح

# userNameH
source: Username
ar: اسم المستخدم

# passwordH
source: Password
ar: كلمة المرور

# phoneNumberH
source: Phone Number
ar: رقم الجوال

source: Note
ar: ملاحظة

# orderTitle
source: Order No.
ar: الطلبية رقم:

# canNotDeleteOrder
source: Can not delete order because it has one left,if you need delete the invoice
ar: لايمكن حذف الطلبية، نظرا لأنها الوحيدة المتبقية، إذا أردت احذف كامل الفاتورة

# canNotDeleteFood
source: Can not delete item because it is the one left at the order,if you need delete it's order
ar: لايمكن حذف هذه المادة، نظرا لأنها الوحيدة المتبقية، إذا أردت احذف كامل الطلبية التابعة لها

# canNotAddOrder
source: You should print the order before adding any else order
ar: الرجاء طباعة الطلبية أولا، لتتمكن من إضافة طلبيات أخرى

source: Order is printed
ar: تمت طباعة الطلبية
